app/views/classrooms/index.html.erb

SELECT "teachers".* FROM "teachers" INNER JOIN "classrooms_teachers" ON "teachers"."id" = "classrooms_teachers"."teacher_id" WHERE "classrooms_teachers"."classroom_id" = 1
---
        <td>
          <% classroom.teachers.each do |teacher| %>