app/views/classrooms/show.html.erb

  <b>Teacher:</b>
  <% @classroom.teachers.each do |teacher| %>
---
SELECT "teachers".* FROM "teachers" INNER JOIN "classrooms_teachers" ON "teachers"."id" = "classrooms_teachers"."teacher_id" WHERE "classrooms_teachers"."classroom_id" = 3

<ol>
  <%  @classroom.lessons.each do |lesson| %>
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."classroom_id" = 2