app/views/students/index.html.erb

SELECT "classrooms".* FROM "classrooms" INNER JOIN "classrooms_students" ON "classrooms"."id" = "classrooms_students"."classroom_id" WHERE "classrooms_students"."student_id" = 1
---
    <td><%= student.email %></td>
    <td><%= student.classrooms.map(&:name).join(",") %></td>