app/views/students/show.html.erb

SELECT "classrooms".* FROM "classrooms" INNER JOIN "classrooms_students" ON "classrooms"."id" = "classrooms_students"."classroom_id" WHERE "classrooms_students"."student_id" = 1
---
  <b>Classes:</b>
  <% @student.classrooms.each do |classroom| %>