app/controllers/classrooms_controller.rb

  def show
    @classroom = Classroom.find(params[:id])
    @messages = Message.where(classroom_id: params[:id])
---
SELECT "classrooms".* FROM "classrooms" WHERE "classrooms"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "messages".* FROM "messages" WHERE "messages"."classroom_id" = 1

  def edit
    @classroom = Classroom.find(params[:id])
---
SELECT "classrooms".* FROM "classrooms" WHERE "classrooms"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @classroom = Classroom.new(params[:classroom])

    respond_to do |format|
      if @classroom.save
---
INSERT INTO "classrooms" ("created_at", "running_date", "teacher_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 27 Oct 2012 06:42:50 UTC +00:00], ["running_date", Sat, 27 Oct 2012 06:42:00 UTC +00:00], ["teacher_id", 1], ["updated_at", Sat, 27 Oct 2012 06:42:50 UTC +00:00]]

  def update
    @classroom = Classroom.find(params[:id])

    respond_to do |format|
      if @classroom.update_attributes(params[:classroom])
---
SELECT "classrooms".* FROM "classrooms" WHERE "classrooms"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "classrooms" SET "name" = 'econ 101', "description" = 'this is basic econ', "updated_at" = '2012-10-28 21:02:02.310636' WHERE "classrooms"."id" = 1

  def destroy
    @classroom = Classroom.find(params[:id])
    @classroom.destroy
---
SELECT "classrooms".* FROM "classrooms" WHERE "classrooms"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "classrooms" WHERE "classrooms"."id" = ?  [["id", 2]]