app/controllers/lessons_controller.rb

  def show
    @lesson = @classroom.lessons.find(params[:id])
    @messages = Message.where(lesson_id: params[:id])
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."classroom_id" = 1 AND "lessons"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "messages".* FROM "messages" WHERE "messages"."lesson_id" = 1

  def edit
    @lesson = @classroom.lessons.find(params[:id])
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."classroom_id" = 1 AND "lessons"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @lesson = @classroom.lessons.new(params[:lesson])

    respond_to do |format|
      if @lesson.save
---
INSERT INTO "lessons" ("class_id", "classroom_id", "created_at", "date", "description", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def find_classroom
    puts params
    @classroom = Classroom.find(params[:classroom_id])
---
SELECT "classrooms".* FROM "classrooms" WHERE "classrooms"."id" = ? LIMIT 1  [["id", "1"]]