app/controllers/messages_controller.rb

  def index
    @messages = Message.all.reverse
---
SELECT "messages".* FROM "messages"

  def edit
    @message = Message.find(params[:id])
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", "21"]]

  def create
    @message = Message.new(params[:message])

    respond_to do |format|
      if @message.save
---
INSERT INTO "messages" ("class_id", "classroom_id", "created_at", "lesson_id", "message", "student_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @message = Message.find(params[:id])

    respond_to do |format|
      if @message.update_attributes(params[:message])
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", "21"]]
UPDATE "messages" SET "classroom_id" = NULL, "lesson_id" = NULL, "message" = 'Geometry isn''t even economics!!!

  def destroy
    @message = Message.find(params[:id])
    @message.destroy
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 1]]