app/controllers/schools_controller.rb

SELECT "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @school = School.find(params[:id])

INSERT INTO "schools" ("address", "created_at", "district", "name", "phone", "updated_at", "website") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @school = School.new(params[:school])

    respond_to do |format|
      if @school.save

SELECT "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "schools" SET "name" = 'Lake Washington', "updated_at" = '2012-10-28 22:43:47.264734' WHERE "schools"."id" = 2
---
  def update
    @school = School.find(params[:id])

    respond_to do |format|
      if @school.update_attributes(params[:school])