app/controllers/students_controller.rb

  def create
    @student = Student.new(params[:student])

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("created_at", "email", "name", "phone", "school_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sun, 28 Oct 2012 22:45:04 UTC +00:00], ["email", "tmont@me.com"], ["name", "Tanner"], ["phone", "87654"], ["school_id", 1], ["updated_at", Sun, 28 Oct 2012 22:45:04 UTC +00:00]]